app/views/matches/index.html.erb

SELECT  "dog_breeds".* FROM "dog_breeds" WHERE "dog_breeds"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
<li>
<% dog = DogBreed.find(match.dog_breed_id) %>