app/views/matches/show.html.erb

<% @dog_breed = DogBreed.find(@match.dog_breed_id) %>
---
SELECT  "dog_breeds".* FROM "dog_breeds" WHERE "dog_breeds"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]