app/controllers/atts_tables_controller.rb

    def create
        @atts_table = AttsTable.create(atts_table_params)
        @atts_table.user_id = session[:user_id]
        @atts_table.save
---
INSERT INTO "atts_tables" ("apartment_friendly", "hypoallergenic", "pet_friendly", "noise", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["apartment_friendly", "t"], ["hypoallergenic", "t"], ["pet_friendly", "f"], ["noise", "f"], ["created_at", "2019-11-03 17:01:04.869131"], ["updated_at", "2019-11-03 17:01:04.869131"]]
UPDATE "atts_tables" SET "user_id" = ?, "updated_at" = ? WHERE "atts_tables"."id" = ?  [["user_id", 2], ["updated_at", "2019-11-03 17:01:04.874987"], ["id", 5]]
UPDATE "users" SET "atts_table_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["atts_table_id", 12], ["updated_at", "2019-11-03 17:33:46.563455"], ["id", 2]]

    def show
        @atts_table = AttsTable.find(params[:id])
---
SELECT  "atts_tables".* FROM "atts_tables" WHERE "atts_tables"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]