app/controllers/atts_tables_controller.rb

    def destroy
        @atts_table.destroy
---
DELETE FROM "atts_tables" WHERE "atts_tables"."id" = ?  [["id", 23]]

    def set_atts
        @atts_table = AttsTable.find(params[:id])
---
SELECT  "atts_tables".* FROM "atts_tables" WHERE "atts_tables"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]