app/controllers/dog_breeds_controller.rb

    def index
        @dogs = DogBreed.all
---
SELECT "dog_breeds".* FROM "dog_breeds" WHERE (name LIKE '%maltese%')

    def show
        @dog = DogBreed.find(params[:id])
---
SELECT  "dog_breeds".* FROM "dog_breeds" WHERE "dog_breeds"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]