app/controllers/matches_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."user_id" = ?  [["user_id", 4]]
SELECT "matches".* FROM "matches"
---
    def index
        if params[:used_id]
            @matches = User.find(params[:user_id]).matches
        else
            @matches = Match.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def create
        params.permit!
        user = User.find(params[:user_id])

SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @match = Match.find(params[:id])

SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def edit
        @match = Match.find(params[:id])

SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "matches" SET "comment_field" = ?, "updated_at" = ? WHERE "matches"."id" = ?
---
    def update
        @match = Match.find(params[:id])
        @match.comment_field = params[:match][:comment_field]
        @match.save

DELETE FROM "matches" WHERE "matches"."id" = ?  [["id", 8]]
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def destroy
        @match = Match.find(params[:id]).destroy