app/controllers/sessions_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "kriskra@optonline.net"], ["LIMIT", 1]]
---
    def create
        params.permit!
       # user_info = request.env['omniauth.auth']
        if  auth_hash = request.env['omniauth.auth']
            #logged in via facebook
            user = User.find_or_create_by_omniauth(auth_hash)
            session[:user_id] = user.id

            redirect_to users_path
        else
            #logged in normal
         user = User.find_by(:email => params[:email])