app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if params[:user][:password] === params[:user][:password_confirmation]
            if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)

    def index
        @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]